In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('StudentMarkSheet.csv')

In [3]:
data

        Student name  Exam name   Exam date  Marks
0       James Walker    Biology  05/06/2016   31.0
1      Velma Clemons    Biology  05/06/2016   43.0
2     Kibo Underwood    Biology  05/06/2016   81.0
3        Louis Mcgee    Biology  05/06/2016   11.0
4       Phyllis Paul    Biology  05/06/2016   18.0
..               ...        ...         ...    ...
195       Yen Bowers  Sociology  21/06/2016   52.0
196        Ryan Pena  Sociology  21/06/2016   16.0
197  Portia Hamilton  Sociology  21/06/2016   34.0
198  Sydnee Chambers  Sociology  21/06/2016   76.0
199      Stacy Small  Sociology  21/06/2016   96.0

[200 rows x 4 columns]

In [4]:
print('rows before removing null elements')
Tbll=len(data.index)
Tbll

rows before removing null elements

200

In [5]:
print('TOTAL NULL ROWS')
null = data.isnull().sum().sum()
null

TOTAL NULL ROWS

4

In [6]:

print('table without null elements')
remove = data.dropna(axis=0, how='any')
remove

table without null elements

        Student name  Exam name   Exam date  Marks
0       James Walker    Biology  05/06/2016   31.0
1      Velma Clemons    Biology  05/06/2016   43.0
2     Kibo Underwood    Biology  05/06/2016   81.0
3        Louis Mcgee    Biology  05/06/2016   11.0
4       Phyllis Paul    Biology  05/06/2016   18.0
..               ...        ...         ...    ...
195       Yen Bowers  Sociology  21/06/2016   52.0
196        Ryan Pena  Sociology  21/06/2016   16.0
197  Portia Hamilton  Sociology  21/06/2016   34.0
198  Sydnee Chambers  Sociology  21/06/2016   76.0
199      Stacy Small  Sociology  21/06/2016   96.0

[196 rows x 4 columns]

In [7]:
print('rows without null elements')
wnull=len(remove.index)
wnull

rows without null elements

196

In [8]:
print('james walker marks for all subject')
james = data.loc[(data['Student name']=='James Walker')]
james

james walker marks for all subject

     Student name    Exam name   Exam date  Marks
0    James Walker      Biology  05/06/2016   31.0
42   James Walker    Chemistry  15/06/2016   61.0
71   James Walker  Mathematics  29/07/2016   23.0
150  James Walker      Physics  10/06/2016  100.0
180  James Walker    Sociology  21/06/2016   73.0